import streamlit as st   # 导入Streamlit并用st代表它
import pandas as pd   # 导入Pandas并用pd代替

st.title("🗄️学生 秋葵-教学档案")
st.header("ℹ️基础信息")
st.text("学生ID：U22053020222541")
st.markdown("注册时间：:green[2022.09.12] |精神状态：✅良好")
st.markdown("当前教室：:green[实训楼710] |安全等级：:green[满级]")

st.header("📊技能矩阵")
c1, c2, c3 = st.columns(3)# 定义列布局，分成3列
c1.metric(label="中文", help="语言类", value="100%", delta="0%")
c2.metric(label="英语", help="语言类",value="80%", delta="-20%")
c3.metric(label="泰语", help="语言类",value="65%", delta="-35%")

st.subheader("⏩️课程进度")
st.text("进度")
st.header("✍任务日志")
# 定义数据,以便创建数据框
data = {
    '学习任务':['中文', '英文', '泰语', '俄语',' 法语'],
    '任务状态':['✅️已完成', '🕐进行中', '🕐进行中', '🕐进行中', '❎️未完成'],
    '任务难度':['★⛤⛤⛤⛤', '★★★⛤⛤', '★★★⛤⛤',' ★★★★⛤',' ★★★⛤⛤'],
}
# 定义数据框所用的索引
index = pd.Series(['01', '02', '03', '04', '05'], name='任务序号')
# 根据上面创建的data和index，创建数据框
df = pd.DataFrame(data, index=index)

st.table(df)

st.subheader("🔐最新代码成果")

python_code = '''def hello():
    print("你好，老师！")
'''
st.code(python_code)

# 分割线
st.markdown('***')

st.markdown(":green[SYSTEM MESSAGE:]下一个任务目标已解锁")
st.markdown(":green[TARGET:]韩语")
st.markdown(":green[COUNTDOWN:]2025-12-18 15:50:22")
st.text("系统状态：在线   连接状态：已加密")
