import streamlit as st
import pandas as pd
import numpy as np



st.header("🍲南宁美食探索")
st.text("探索广西南宁最受欢迎的美食地点！选择你感兴趣的餐厅类型，查看评分和位置。")
st.subheader("📍南宁美食地图")

map_data={
    "latitude": [22.811045, 22.867965, 22.843267, 22.809343, 22.811859],
    "longitude": [108.388877,108.250785, 108.268211, 108.373935, 108.392082]
    }
mapd=pd.DataFrame(map_data)

st.map(mapd)



st.subheader("⭐️餐厅评分")

# 定义数据,以便创建数据框
fen_data = {
    "餐厅":["新天海南鸡饭(石门公园店)", "广西壮锦博物馆艺术主题餐厅·广西菜","胜记海鲜煲仔粥(动物园店)","樾餐厅泰式海鲜火锅(民歌湖店)","焱铁烧·黑毛和牛专门店(南宁万象城店)"],
    "评分":[4.0,4.8,4.3,5.0,4.4]

}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(fen_data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,4,5], name='评分')
# 将新索引应用到数据框上
df.index = index


# 通过x指定月份所在这一列为条形图的x轴
st.bar_chart(df, x='餐厅')











st.subheader("🕐用餐高峰时段")
can_data={
    "餐厅":["新天海南鸡饭(石门公园店)", "广西壮锦博物馆艺术主题餐厅·广西菜","胜记海鲜煲仔粥(动物园店)","樾餐厅泰式海鲜火锅(民歌湖店)","焱铁烧·黑毛和牛专门店(南宁万象城店)"],
    '12点':[150,140,30,54,144],
    '13点':[160,150,200,145,121],
    '14点':[59,98,140,54,63],
    '15点':[40,55,66,41,25],
    '16点':[50,60,71,55,94],
    '17点':[154,244,156,225,156],
    '18点':[200,251,354,125,156],
    '19点':[156,145,135,145,126],
    '20点':[125,114,101,92,158],
    '21点':[50,46,55,80,93],
    '22点':[23,12,60,35,14],
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(can_data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,4,5], name='12点')
# 将新索引应用到数据框上
df.index = index



# 通过x指定月份所在这一列为面积图的x轴
st.area_chart(df, x='餐厅')



st.subheader("💹餐厅1-12月价格走势")
# 定义数据,以便创建数据框
data = {
    '月份':['01月', '02月', '03月', '04月', '05月', '06月', '07月', '08月', '09月', '10月', '11月', '12月'],
    '新天海南鸡饭(石门公园店)':[200, 150, 180,102,111,445,125,425,141,415,452,421],
    '广西壮锦博物馆艺术主题餐厅·广西菜':[120, 160, 123,111,514,112,254,154,136,142,152,114],
    '胜记海鲜煲仔粥(动物园店)':[110, 100, 160,178,169,166,415,152,141,471,145,141],
    '樾餐厅泰式海鲜火锅(民歌湖店)':[14,14,12,12,13,10,15,16,14,14,14,12],
    '焱铁烧·黑毛和牛专门店(南宁万象城店)':[22,52,34,35,36,36,41,55,45,16,45,12],
}
# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,4,5,6,7,8,9,10,11,12], name='序号')
# 将新索引应用到数据框上
df.index = index

# 使用write()方法展示数据框
st.write(df)

# 通过x指定月份所在这一列为折线图的x轴
st.line_chart(df, x='月份')


# 修改df，用月份列作为df的索引，替换原有的索引
df.set_index('月份', inplace=True)
